jmeter-tests/report/statistics.json
{
  "Payment API" : {
    "transaction" : "Payment API",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.6,
    "medianResTime" : 1.5,
    "minResTime" : 1.0,
    "maxResTime" : 3.0,
    "pct1ResTime" : 2.9000000000000004,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 3.0,
    "throughput" : 7.722007722007723,
    "receivedKBytesPerSec" : 3.8685448841698844,
    "sentKBytesPerSec" : 3.6046090733590734
  },
  "Rewards Spin API" : {
    "transaction" : "Rewards Spin API",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.7,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 7.733952049497293,
    "receivedKBytesPerSec" : 2.4251679717710752,
    "sentKBytesPerSec" : 3.013522331786543
  },
  "AI Advisor API" : {
    "transaction" : "AI Advisor API",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.8999999999999999,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 7.727975270479135,
    "receivedKBytesPerSec" : 2.731960007727975,
    "sentKBytesPerSec" : 3.1772242078825346
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 70,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 28.100000000000005,
    "medianResTime" : 2.5,
    "minResTime" : 0.0,
    "maxResTime" : 260.0,
    "pct1ResTime" : 64.0,
    "pct2ResTime" : 106.05000000000003,
    "pct3ResTime" : 260.0,
    "throughput" : 36.55352480417755,
    "receivedKBytesPerSec" : 14.498510933420365,
    "sentKBytesPerSec" : 12.213405678851174
  },
  "Signup API" : {
    "transaction" : "Signup API",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 90.1,
    "medianResTime" : 70.0,
    "minResTime" : 53.0,
    "maxResTime" : 222.0,
    "pct1ResTime" : 210.90000000000003,
    "pct2ResTime" : 222.0,
    "pct3ResTime" : 222.0,
    "throughput" : 6.618133686300464,
    "receivedKBytesPerSec" : 3.1604173560555924,
    "sentKBytesPerSec" : 1.7256266545334218
  },
  "Generate Dynamic Auth Data" : {
    "transaction" : "Generate Dynamic Auth Data",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 31.900000000000002,
    "medianResTime" : 6.5,
    "minResTime" : 5.0,
    "maxResTime" : 260.0,
    "pct1ResTime" : 234.8000000000001,
    "pct2ResTime" : 260.0,
    "pct3ResTime" : 260.0,
    "throughput" : 5.717552887364208,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.0
  },
  "Profile API" : {
    "transaction" : "Profile API",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 14.6,
    "medianResTime" : 2.0,
    "minResTime" : 2.0,
    "maxResTime" : 48.0,
    "pct1ResTime" : 47.7,
    "pct2ResTime" : 48.0,
    "pct3ResTime" : 48.0,
    "throughput" : 7.610350076103501,
    "receivedKBytesPerSec" : 4.325413812785388,
    "sentKBytesPerSec" : 4.399733637747336
  },
  "Login API" : {
    "transaction" : "Login API",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 56.9,
    "medianResTime" : 56.5,
    "minResTime" : 52.0,
    "maxResTime" : 64.0,
    "pct1ResTime" : 64.0,
    "pct2ResTime" : 64.0,
    "pct3ResTime" : 64.0,
    "throughput" : 7.496251874062969,
    "receivedKBytesPerSec" : 4.2166416791604195,
    "sentKBytesPerSec" : 1.742292916041979
  }
}