jmeter-tests/report/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 3,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 192.33333333333331,
    "medianResTime" : 246.0,
    "minResTime" : 61.0,
    "maxResTime" : 270.0,
    "pct1ResTime" : 270.0,
    "pct2ResTime" : 270.0,
    "pct3ResTime" : 270.0,
    "throughput" : 4.846526655896607,
    "receivedKBytesPerSec" : 1.680192346526656,
    "sentKBytesPerSec" : 0.7967109248788369
  },
  "Signup API" : {
    "transaction" : "Signup API",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 246.0,
    "medianResTime" : 246.0,
    "minResTime" : 246.0,
    "maxResTime" : 246.0,
    "pct1ResTime" : 246.0,
    "pct2ResTime" : 246.0,
    "pct3ResTime" : 246.0,
    "throughput" : 4.065040650406504,
    "receivedKBytesPerSec" : 1.9412157012195121,
    "sentKBytesPerSec" : 1.0599275914634148
  },
  "Generate Dynamic Auth Data" : {
    "transaction" : "Generate Dynamic Auth Data",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 270.0,
    "medianResTime" : 270.0,
    "minResTime" : 270.0,
    "maxResTime" : 270.0,
    "pct1ResTime" : 270.0,
    "pct2ResTime" : 270.0,
    "pct3ResTime" : 270.0,
    "throughput" : 3.7037037037037037,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.0
  },
  "Login API" : {
    "transaction" : "Login API",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 61.0,
    "medianResTime" : 61.0,
    "minResTime" : 61.0,
    "maxResTime" : 61.0,
    "pct1ResTime" : 61.0,
    "pct2ResTime" : 61.0,
    "pct3ResTime" : 61.0,
    "throughput" : 16.393442622950822,
    "receivedKBytesPerSec" : 9.221311475409836,
    "sentKBytesPerSec" : 3.8101946721311477
  }
}